### Pandas
- DataFrame and Series
- Data Manipulation and Cleaning
- Heterogenous Tabular DS

In [1]:
import pandas as pd

In [7]:
#Series - 1D array like object that can hold any data type. It is similar to a column in a table.

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series\n",series,sep="")
print(type(series))

Series
0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
#Series from Dict
data={"a":1,"b":2,"c":3}
series_dict=pd.Series(data)

In [10]:
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [11]:
data=[10,20,30]
index=["a","b","c"]
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [15]:
#Dataframe from Dict
#Create a Dataframe from Dictionary of List
data={
    'Name':['Hritik','Jack','John'],
    'Age':[25,35,45],
    'City':['Bangalore','New York','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age       City
0  Hritik   25  Bangalore
1    Jack   35   New York
2    John   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [16]:
import numpy as np
np.array(df)

array([['Hritik', 25, 'Bangalore'],
       ['Jack', 35, 'New York'],
       ['John', 45, 'Florida']], dtype=object)

In [12]:
# Dataframe
# 2D mutable and heterogenous tabular data
data=pd.read_csv("data.csv")
data.head()

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [18]:
#Create Dataframe from list of dictionaries

data=[
    {'Name':'Hritik','Age':25,'City':'Bangalore'},
    {'Name':'Jack','Age':35,'City':'Bangalore'},
    {'Name':'John','Age':45,'City':'Bangalore'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age       City
0  Hritik   25  Bangalore
1    Jack   35  Bangalore
2    John   45  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [23]:
df=pd.read_csv("data.csv")
print(df.head())

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [24]:
df.tail()

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [27]:
# Accessing Data from dataframe
data=[
    {'Name':'Hritik','Age':25,'City':'Bangalore'},
    {'Name':'Jack','Age':35,'City':'Bangalore'},
    {'Name':'John','Age':45,'City':'Bangalore'}
]
df=pd.DataFrame(data)

In [30]:
df

     Name  Age       City
0  Hritik   25  Bangalore
1    Jack   35  Bangalore
2    John   45  Bangalore

In [31]:
df['Name']

0    Hritik
1      Jack
2      John
Name: Name, dtype: object

In [32]:
type(df['Name'])

pandas.core.series.Series

In [35]:
df.loc[0] #Pick up 0th Row (location)

Name       Hritik
Age            25
City    Bangalore
Name: 0, dtype: object

In [36]:
df.iloc[0]

Name       Hritik
Age            25
City    Bangalore
Name: 0, dtype: object

In [37]:
df.loc[0][0]

C:\Users\agarw\AppData\Local\Temp\ipykernel_5456\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Hritik'

In [38]:
df.iloc[0][0]

C:\Users\agarw\AppData\Local\Temp\ipykernel_5456\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Hritik'

In [39]:
#Accessing a specified element
df['Name']

0    Hritik
1      Jack
2      John
Name: Name, dtype: object

In [40]:
df

     Name  Age       City
0  Hritik   25  Bangalore
1    Jack   35  Bangalore
2    John   45  Bangalore

In [41]:
df.at[1,'Age']

np.int64(35)

In [45]:
df.iat[1,2]

'Bangalore'

In [46]:
#Data Manipulation with Dataframe
df

     Name  Age       City
0  Hritik   25  Bangalore
1    Jack   35  Bangalore
2    John   45  Bangalore

In [47]:
#Adding a column
df['Salary']=[50000,60000,70000]

In [48]:
df

     Name  Age       City  Salary
0  Hritik   25  Bangalore   50000
1    Jack   35  Bangalore   60000
2    John   45  Bangalore   70000

In [52]:
#Remove a column
df.drop('Salary',axis=1, inplace=True)

In [53]:
df

     Name  Age       City
0  Hritik   25  Bangalore
1    Jack   35  Bangalore
2    John   45  Bangalore

In [54]:
#Add Age to the Column
df['Age']=df['Age']+1
df

     Name  Age       City
0  Hritik   26  Bangalore
1    Jack   36  Bangalore
2    John   46  Bangalore

In [57]:
#drop based on row
df.drop(0,inplace=True)

In [58]:
df

   Name  Age       City
1  Jack   36  Bangalore
2  John   46  Bangalore

In [59]:
df=pd.read_csv("data.csv")
print(df.head())

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [60]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000